[
  {
    "id": 1,
    "text": "Who might be hiding their pain today behind a smile?",
    "reflection": "Ask the Lord to reveal someone in your life who needs hope. Start with a simple message: 'I've been thinking of you—how are you really?' Theophilus can help you continue from there.",
    "verse": null,
    "image": "evangelism_door_01.png",
    "approved": false
  },
  {
    "id": 2,
    "text": "Every soul is a door Christ knocks on.",
    "reflection": "Visual post idea:\nImage: A pair of empty slippers at a door.\nCaption: 'Will you be His voice today?'\nCall to action: 'Ask Theophilus how to start spiritual conversations.'",
    "verse": "Revelation 3:20",
    "image": "evangelism_slippers_door.png",
    "approved": false
  },
  {
    "id": 3,
    "text": "There is nothing colder than a Christian who does not seek to save others.",
    "reflection": "St. John Chrysostom once said this to stir sleeping hearts. Let your heart burn today—for one soul, even just one.",
    "verse": "St. John Chrysostom, Homily 20 on Acts",
    "image": "evangelism_chrysostom_01.png",
    "approved": false
  },
  {
    "id": 4,
    "text": "You might be one conversation away from changing someone’s eternity.",
    "reflection": "What if Christ wants to use your voice today? Ask Theophilus for the words to begin. He will guide you.",
    "verse": null,
    "image": "evangelism_conversation_01.png",
    "approved": false
  },
  {
    "id": 5,
    "text": "Let your light shine—not just on Sunday, but today.",
    "reflection": "A kind word. A question asked gently. A story shared. This is how Christ walks through us. Theophilus is ready to help.",
    "verse": "Matthew 5:16",
    "image": "evangelism_light_01.png",
    "approved": false
  },
  {
    "id": 6,
    "text": "Evangelism starts with presence.",
    "reflection": "Be there for someone. Listen without rushing. Let the conversation slow down enough for grace to slip in. If you're unsure how to guide it, ask Theophilus.",
    "verse": null,
    "image": "evangelism_listen_01.png",
    "approved": false
  },
  {
    "id": 7,
    "text": "You are a living letter from Christ.",
    "reflection": "Your story matters. Share how God met you. Don’t underestimate what a single testimony can do. (See 2 Corinthians 3:3)",
    "verse": "2 Corinthians 3:3",
    "image": "evangelism_journal_01.png",
    "approved": false
  },
  {
    "id": 8,
    "text": "A prayer before a conversation can open more than mouths—it can open hearts.",
    "reflection": "Before you meet someone today, whisper a quiet prayer: 'Lord, speak through me.' Then trust. Theophilus can help if you get stuck.",
    "verse": null,
    "image": "evangelism_prayer_01.png",
    "approved": false
  },
  {
    "id": 9,
    "text": "Your friend doesn’t need a sermon. They need you to care.",
    "reflection": "Start small. Ask questions. Share gently. Let love lead the way, and Theophilus will help you make Christ known.",
    "verse": null,
    "image": "evangelism_friend_01.png",
    "approved": false
  },
  {
    "id": 10,
    "text": "There are wounds only Christ can heal—but He sends us to carry the oil and wine.",
    "reflection": "Think of the Samaritan. Evangelism isn’t only words—it’s presence, compassion, action. Who needs you today?",
    "verse": "Luke 10:33–34",
    "image": "evangelism_samaritan_01.png",
    "approved": false
  },
  {
    "id": 11,
    "text": "God works through interruption.",
    "reflection": "Was today quieter than you hoped? Maybe that's space for an unexpected conversation. Stay open. Ask Theophilus how to recognize those moments.",
    "verse": null,
    "image": "evangelism_pathway_01.png",
    "approved": false
  },
  {
    "id": 12,
    "text": "Sometimes, the right question is more powerful than the perfect answer.",
    "reflection": "Don't fear being unprepared. Ask, listen, love. Theophilus will help you with the rest.",
    "verse": null,
    "image": "evangelism_questions_01.png",
    "approved": false
  }
]